cmsis-svd/cmsis-svd/data/Infineon/psoc4100s.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PASS0</name>
      <description>PASS top-level MMIO (DSABv2, INTR)</description>
      <headerStructName>PASS</headerStructName>
      <baseAddress>0x403F0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>INTR_CAUSE</name>
          <description>Interrupt cause register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>CTB0_INT</name>
              <description>CTB0 interrupt pending</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CTB1_INT</name>
              <description>CTB1 interrupt pending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CTB2_INT</name>
              <description>CTB2 interrupt pending</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CTB3_INT</name>
              <description>CTB3 interrupt pending</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DFT_CTRL</name>
          <description>DFT control register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>DSAB_ADFT_RES_EN</name>
              <description>Close the switch to connect the DSAB ADFT resistor to the AMUXBUS</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PASS_CTRL</name>
          <description>PASS Control</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF03</resetMask>
          <fields>
            <field>
              <name>PMPCLK_BYP</name>
              <description>- 0: Pump clk is clk_hf/2
 - 1: Pump clk is selected from PMPCLK_SRC</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PMPCLK_SRC</name>
              <description>- 0: Pump clk is clk_hf
 - 1: Pump clk is direct from SRSS</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RMB_BITS</name>
              <description>Risk mitigation bits</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <name>DSAB</name>
          <description>DSAB configuration</description>
          <addressOffset>0x00000E00</addressOffset>
          <register>
            <name>DSAB_CTRL</name>
            <description>global DSAB control</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x910F0F3F</resetMask>
            <fields>
              <field>
                <name>CURRENT_SEL</name>
                <description>DSAB DAC control field

Nominal DSAB Output Current = CURRENT_SEL * 0.075 uA

In products with SRSS-LITE, this setting impacts the CTB(m) offset. A value of 0x20 is used during factory trim and is required to maintain low offsets across temperature variation. If a different setting is used then a periodic re-trim of CTB(m) offset should be performed.</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SEL_OUT</name>
                <description>N/A</description>
                <bitRange>[11:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>REF_SWAP_EN</name>
                <description>This field (along with SEL_OUT and ENABLED) provides bitwise selection of the current sources that drive the DSAB ZTC and PTAT outputs.

See SEL_OUT field for truth tables.</description>
                <bitRange>[19:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BYPASS_MODE_EN</name>
                <description>0 - DSAB PTAT generator is powered from DSAB regulator: VDDA must be at least 2.4V
1 - DSAB PTAT generator is pwoered directly from VDDA: VDDA cannot exceed 4.0V</description>
                <bitRange>[24:24]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>STARTUP_RM</name>
                <description>Risk mitigation control                                                                                         
1 - Force start the startup circuit</description>
                <bitRange>[28:28]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLED</name>
                <description>This field (along with SEL_OUT and REF_SWAP_EN) provides bitwise selection of the current sources that drive the DSAB ZTC and PTAT outputs.
See SEL_OUT field for truth tables.
In SRSSLT devices, in active mode, this bit is overridden to '1', that is - it is always enabled in active mode.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DSAB_DFT</name>
            <description>DFT bits</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>EN_DFT</name>
                <description>- 0: DSAB DFT disabled
- 1: DSAB DFT enabled (connect output to amuxbus)

0001 - PTAT&lt;0&gt;
0010 - PTAT&lt;1&gt;
0011 - PTAT&lt;1:0&gt;
0100 - PTAT&lt;2&gt;
0111 - PTAT&lt;2:0&gt;
1000 - PTAT&lt;3&gt;
1111 - PTAT&lt;3:0&gt; 
1001 - DSAB Reg Out</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>DSAB_TRIM</name>
          <description>DSAB Trim bits</description>
          <addressOffset>0xF00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>IBIAS_TRIM</name>
              <description>1111=lowest, 0000=highest</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSAB_RMB_BITS</name>
              <description>Risk mitigation bits</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>